{
  "backend/main.mo": "Main Motoko actor for the 80s movie catalog app, providing CRUD operations for movies and user profiles with role-based access control, pagination, and blob storage support.",
  "feature_evidence.json": "Feature evidence report linking the MovieGrid/useQueries fix (loading, error, empty state handling) to its relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON mapping of frontend source file paths to short descriptions of each file's purpose and key implementation details.",
  "frontend/docs/publishing.md": "Guide explaining how to publish from Draft to Live in Caffeine, including a publishing checklist and troubleshooting steps for common issues like stopped canisters and blank login popups.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining CSS custom property tokens for light and dark themes used by shadcn-ui components.",
  "frontend/index.html": "HTML entry point for the Russian-language 80s cinema PWA, setting metadata, icons, manifest link, and mounting the React app at #root.",
  "frontend/public/manifest.webmanifest": "PWA web app manifest for 'Кино 80-х' defining app name, display mode, theme colors, and icon assets in multiple sizes.",
  "frontend/public/sw.js": "Service worker implementing a network-first caching strategy for same-origin requests, with app shell caching on install and old cache cleanup on activate.",
  "frontend/QA-delete-button-ownership.md": "Manual QA checklist with step-by-step test cases to verify that the Delete button on movie cards correctly appears and disappears based on authenticated ownership without requiring a page refresh.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, ThemeProvider, and BackendAvailabilityProvider, then renders the main app layout with Header, MovieGrid, Footer, and dialogs, handling loading and backend-unavailable states.",
  "frontend/src/components/AddMovieDialog.tsx": "Dialog component for adding a new movie, handling form state for title, description, genres, and photo uploads (up to 3), with authentication guards and progress tracking via ExternalBlob.",
  "frontend/src/components/AuthControls.tsx": "UI component rendering a login/logout button using Internet Identity, clearing React Query cache on logout and handling already-authenticated edge cases.",
  "frontend/src/components/BackendUnavailableScreen.tsx": "Full-screen error overlay displayed when the backend canister is unreachable, showing an error message, auto-retry countdown, and manual retry/reload buttons.",
  "frontend/src/components/BackgroundMusic.tsx": "Floating mute/unmute button that plays a looping synthwave audio track via the Web Audio API, auto-playing on first user interaction if autoplay is blocked.",
  "frontend/src/components/Footer.tsx": "Page footer displaying copyright, a retro tagline, and links to PublishingHelpDialog and InstallHelpDialog components.",
  "frontend/src/components/Header.tsx": "Page header with app title, a genre filter Select dropdown, an Add Movie button (auth-gated), and AuthControls, reporting backend unavailability errors from genre loading.",
  "frontend/src/components/InstallHelpDialog.tsx": "Dialog providing step-by-step PWA installation instructions for Android (Chrome) and iOS (Safari) users.",
  "frontend/src/components/MovieCard.tsx": "Displays a single movie as a card with photo cycling, genre badges, and a delete button (owner-only) with confirmation dialog.",
  "frontend/src/components/MovieDetailDialog.tsx": "Modal dialog showing full movie details with a navigable photo gallery, genre badges, and metadata like year and description.",
  "frontend/src/components/MovieGrid.tsx": "Fetches and renders a paginated or genre-filtered grid of MovieCards, handling loading skeletons, offline state, and backend unavailability errors.",
  "frontend/src/components/PaginationControls.tsx": "Renders numbered pagination buttons with ellipsis logic for navigating between pages of movies.",
  "frontend/src/components/PublishingHelpDialog.tsx": "Help dialog explaining how to publish the app from draft to production on Internet Computer and how to troubleshoot common backend errors.",
  "frontend/src/components/VHSEffects.tsx": "Renders animated retro VHS-style visual effects (scan lines, glitch, pixel noise) on a canvas overlay along with neon grid background images.",
  "frontend/src/context/BackendAvailabilityContext.tsx": "Provides a React context that tracks backend availability state ('checking', 'available', 'unavailable'), exposes error reporting and manual retry, and auto-retries queries every 10 seconds when the backend is unavailable.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Wraps a backend health-check call in a React Query hook, exposing isHealthy and isChecking flags with a 15-second stale time and single retry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login/logout state and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations (fetching movies, genres, pagination, filtering, and CRUD mutations), with backend-unavailability error handling integrated throughout.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS and defines a 1980s neon theme with custom CSS variables (hot pink, teal, amber on charcoal) plus retro utility classes and panel styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/utils/errors.ts": "Provides normalizeError to convert errors into user-friendly Russian messages and isBackendUnavailableError to detect stopped-canister or actor-initialization failures.",
  "frontend/src/utils/movieOwnership.ts": "Exports a single helper function isMovieOwner that checks whether the currently authenticated user's principal matches a movie's creator field.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those values via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom OKLCH-based color tokens (primary, sidebar, retro palette, charts), border radii, box shadows, and enables the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a fix request for a catalog page loading failure, tracking one existing feature fix (MovieGrid/React Query) and one pending backend audit task (Motoko actor crash)."
}