{
  "backend/main.mo": "Motoko backend canister providing user profiles, auth checks, and CRUD operations for movies with access control.",
  "feature_evidence.json": "Lists feature evidence reports linking features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files and components for reference.",
  "frontend/docs/publishing.md": "Guide explaining how to publish Draft to Live in Caffeine and troubleshoot backend or authentication issues.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables and theming, including light/dark modes.",
  "frontend/index.html": "Base HTML document loading the React app with Russian metadata and PWA-related tags.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata including icons, colors, names, and start URL.",
  "frontend/public/sw.js": "Service worker implementing network-first caching, offline fallback for navigation, and cache version management.",
  "frontend/QA-delete-button-ownership.md": "Manual QA checklist verifying correct Delete-button visibility based on movie ownership and authentication state.",
  "frontend/src/App.tsx": "Sets up global providers, handles service worker registration, backend availability checks, and renders the main layout with header, movie grid, footer, and dialogs.",
  "frontend/src/components/AddMovieDialog.tsx": "Provides a modal for authenticated users to add movies with genres and photo uploads, including validation and progress tracking.",
  "frontend/src/components/AuthControls.tsx": "Handles login/logout with Internet Identity and clears cached data on logout, showing appropriate UI state.",
  "frontend/src/components/BackendUnavailableScreen.tsx": "Displays a full‑screen error with retry and reload options when the backend is unreachable.",
  "frontend/src/components/BackgroundMusic.tsx": "Autoplays looping background music with mute/unmute control and fallback for autoplay restrictions.",
  "frontend/src/components/Footer.tsx": "Renders the retro‑styled footer with credits and access to publishing and installation help dialogs.",
  "frontend/src/components/Header.tsx": "Shows the title, genre selector, auth controls, and add‑movie button while reporting backend‑loading issues.",
  "frontend/src/components/InstallHelpDialog.tsx": "Provides a dialog explaining how to install the PWA on Android and iOS devices.",
  "frontend/src/components/MovieCard.tsx": "Displays a movie card with photo carousel, ownership-based delete option, and click-to-open detail handling.",
  "frontend/src/components/MovieDetailDialog.tsx": "Shows a dialog with full movie details and a photo viewer supporting navigation and thumbnail selection.",
  "frontend/src/components/MovieGrid.tsx": "Fetches and displays movies in a grid with pagination, genre filtering, error handling, and detail dialog integration.",
  "frontend/src/components/PaginationControls.tsx": "Renders numbered pagination buttons with ellipsis logic and triggers page changes.",
  "frontend/src/components/PublishingHelpDialog.tsx": "Provides a help dialog explaining how to publish an app and troubleshoot common backend issues.",
  "frontend/src/components/VHSEffects.tsx": "Renders retro VHS-style visual effects using canvas plus layered background overlays.",
  "frontend/src/context/BackendAvailabilityContext.tsx": "Provides context for backend availability state, handling health checks, errors, and retry logic with query refetching.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend health using the actor, exposing health status and retry behavior with react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, exposing identity, login/logout actions, and login state through a React context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend movie-related queries with actor readiness and backend availability checks, reporting unavailability errors.",
  "frontend/src/index.css": "Defines Tailwind-based global styles and an 80s neon theme with custom CSS variables and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing query client and Internet Identity context to the component tree.",
  "frontend/src/utils/errors.ts": "Normalizes backend and actor errors into user-friendly messages and detects backend-unavailable error types.",
  "frontend/src/utils/movieOwnership.ts": "Provides a helper to check whether the current identity matches a movie’s creator.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from either session or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, layout settings, extensions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, existing features, pending feature requests, and known deployment issues for the app recovery and health‑check work."
}