{
  "backend/main.mo": "Motoko canister managing user profiles and movies with authentication, authorization, and CRUD operations including paginated movie retrieval.",
  "feature_evidence.json": "Feature evidence report mapping pagination-related frontend updates to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend file in the project.",
  "frontend/docs/publishing.md": "Guide explaining how to publish Draft changes to Live, verify deployments, and troubleshoot common issues.",
  "frontend/index.css": "Tailwind-based CSS defining root theme variables and dark-mode color tokens applied globally.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/QA-delete-button-ownership.md": "Manual QA checklist verifying correct Delete-button visibility based on movie ownership and authentication state.",
  "frontend/src/App.tsx": "Main React component configuring theme, global effects, header, movie grid, footer, and add-movie dialog.",
  "frontend/src/components/AddMovieDialog.tsx": "Dialog for adding a movie with title, description, genres, and up to three photos, including upload progress and auth checks.",
  "frontend/src/components/AuthControls.tsx": "Login/logout button component that manages Internet Identity authentication and clears cached data on logout.",
  "frontend/src/components/BackgroundMusic.tsx": "Autoplays looping background synthwave music with a mute toggle button and basic autoplay fallback handling.",
  "frontend/src/components/Footer.tsx": "Footer displaying credits, retro styling, and a link to the publishing help dialog.",
  "frontend/src/components/Header.tsx": "Header with title, genre selector, and an authenticated-only trigger for opening the add-movie dialog.",
  "frontend/src/components/MovieCard.tsx": "Displays a movie card with photo cycling, ownership‑gated delete action, and click-to-open detail dialog.",
  "frontend/src/components/MovieDetailDialog.tsx": "Dialog showing movie details with swipe and arrow navigation for photos and responsive fullscreen layout.",
  "frontend/src/components/MovieGrid.tsx": "Displays movies with pagination or genre filtering, handles loading/error states, and opens a detail dialog for a selected movie.",
  "frontend/src/components/PaginationControls.tsx": "Renders numbered pagination buttons with ellipsis logic and triggers page changes.",
  "frontend/src/components/PublishingHelpDialog.tsx": "Provides a help dialog explaining publishing steps and troubleshooting guidance.",
  "frontend/src/components/VHSEffects.tsx": "Creates animated VHS-style visual effects using a canvas and layered background overlays.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, auto‑refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context for Internet Identity, handling login, identity loading, and session state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching movies, pagination info, genres, and filtered results using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and a full 80s neon-theme color variable system plus utility classes and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/utils/errors.ts": "Maps backend error messages to clearer user-friendly strings with special cases for canister and auth errors.",
  "frontend/src/utils/movieOwnership.ts": "Provides a helper to check whether the current authenticated user owns a given movie.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors with CSS variables and enabling plugins and container settings.",
  "project_state.json": "Metadata describing project state, features, and pending requests for pagination enhancements."
}