{
  "backend/main.mo": "Main canister with movie CRUD, user profiles, access control, and storage integration using authorization mixins.",
  "backend/migration.mo": "Migration module converting old movie data to new format by adding default creators and initializing user profiles.",
  "feature_evidence.json": "Metadata file listing frontend components and evidence for implementing auth-based UI restrictions.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend components and utilities.",
  "frontend/index.css": "Global Tailwind-based style theme defining light/dark CSS variables and applying base color tokens.",
  "frontend/index.html": "Minimal HTML shell mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component setting dark theme, rendering effects, layout, movie grid, and add-movie dialog.",
  "frontend/src/components/AddMovieDialog.tsx": "Dialog for adding movies with auth guards, genre/photo inputs, blob uploads, and error normalization.",
  "frontend/src/components/BackgroundMusic.tsx": "Synthwave background music controller with autoplay handling and mute toggle.",
  "frontend/src/components/Footer.tsx": "Retro‑styled footer with neon aesthetic, branding, and VCR‑style text.",
  "frontend/src/components/Header.tsx": "Renders the site header with genre selection and an add‑movie button gated by authentication.",
  "frontend/src/components/MovieCard.tsx": "Displays a movie card with photo cycling, detail opening, and owner‑restricted delete functionality.",
  "frontend/src/components/MovieDetailDialog.tsx": "Shows a modal with movie details and swipeable photo navigation supporting keyboard and touch controls.",
  "frontend/src/components/MovieGrid.tsx": "Fetches and displays movies in a grid with pagination or genre filtering and opens detailed view dialogs.",
  "frontend/src/components/VHSEffects.tsx": "Renders animated VHS‑style visual effects using a canvas and layered retro backgrounds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity, login, logout, and login status helpers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, filtering, adding, and deleting movies through the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles and custom 80s‑themed color variables and utilities for global app styling.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/utils/errors.ts": "Normalizes backend errors into clearer user‑friendly messages, especially for authorization and authentication cases.",
  "frontend/src/utils/movieOwnership.ts": "Utility to check whether the current authenticated user is the creator/owner of a movie.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence and hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and utilities using CSS variables for the neon palette.",
  "project_state.json": "Metadata describing project state, feature requirements, authorization issues, and pending requests related to movie ownership and access control."
}