{
  "kind": "build_request",
  "title": "Restore app usability when deployment fails or backend canister is stopped",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a lightweight backend health endpoint that can be called without authentication so the frontend can distinguish between (a) backend reachable and (b) backend stopped/unavailable.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "восстановить"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo exposes a new public query method (e.g., health()) that returns a simple value (e.g., \"ok\" and/or a build/version string).",
        "The health method does not require any permissions and does not trap for anonymous callers.",
        "Calling the health method succeeds when the canister is running."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a dedicated full-page 'Backend unavailable' recovery UI that appears when core queries fail due to a stopped canister or actor initialization failure, and provide clear recovery actions (Reload, Retry) without leaving the user on a broken screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "восстановить"
        ]
      },
      "acceptanceCriteria": [
        "When requests fail with a stopped-canister signature (e.g., Reject code: 5 / \"canister is stopped\") the app shows a prominent recovery panel instead of an empty/partial UI.",
        "The recovery panel includes: (1) a Reload button that refreshes the page, and (2) a Retry button that re-runs the health check and refetches queries without a full reload.",
        "The recovery panel surfaces the existing stopped-canister copy already used by frontend/src/utils/errors.ts (do not regress this message).",
        "When the backend becomes available again, the app returns to normal operation without requiring a hard refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a startup connectivity check (using the new backend health endpoint) that runs before enabling movie/genre queries, and route query failures into the recovery UI so users can reliably 'restore' the app after transient deployment/canister restarts.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "восстановить"
        ]
      },
      "acceptanceCriteria": [
        "On initial load, the frontend performs a health check before enabling data queries; while checking, the UI shows a non-blocking loading state (not a blank screen).",
        "If the health check fails, movie/genre/pagination queries are not executed repeatedly; instead, the recovery UI is shown.",
        "Pressing Retry triggers the health check again and, on success, triggers React Query refetch for movies/genres/pagination."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text in this build request (specification text), but do not unintentionally change existing in-app localized strings unless required by the recovery UI."
  ],
  "nonGoals": [
    "Automating or performing the actual Caffeine dashboard publish/republish operation (outside the app code).",
    "Adding external monitoring, logging services, or third-party uptime checks.",
    "Changing authentication providers (Internet Identity remains the only auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}