{
  "kind": "build_request",
  "title": "Add numbered pagination controls to movie grid",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query that returns pagination metadata for the movie list so the frontend can render numbered page controls (at minimum: totalPages for the current ITEMS_PER_PAGE).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "добавить нумерацию страниц чтоб можно было выбирать на какую переключить"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new query method that returns the total number of pages for the movies collection based on ITEMS_PER_PAGE.",
        "For 0 movies, totalPages is 0 (or 1 if the chosen UX requires it), and the method does not trap.",
        "The method is query-only and does not mutate state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend movie grid pagination UI to include clickable numbered page controls so users can directly jump to a specific page (while keeping existing Back/Next controls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "добавить нумерацию страниц чтоб можно было выбирать на какую переключить"
        ]
      },
      "acceptanceCriteria": [
        "When not filtering by genre, the pagination area shows clickable page numbers and the current page is visually highlighted.",
        "Clicking a page number loads that page via the existing paginated query and updates the current page indicator (page is 1-based in UI, but uses 0-based indexing internally).",
        "Back/Next buttons continue to work and remain disabled appropriately at bounds (first/last page).",
        "When a genre filter is active, numbered pagination controls are hidden (or disabled) consistently with the existing behavior (pagination is only for the unfiltered list).",
        "If there are many pages, the UI does not render an excessively long row of buttons; it uses a compact windowed layout with ellipses (e.g., first/last + pages around current)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a React Query hook to fetch the new backend pagination metadata and wire it into MovieGrid so the numbered pagination reflects the real total pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "добавить нумерацию страниц чтоб можно было выбирать на какую переключить"
        ]
      },
      "acceptanceCriteria": [
        "A new query hook exists alongside useGetMovies/useFilterByGenre to fetch total pages (or equivalent) from the backend.",
        "MovieGrid uses this metadata to determine the last page and to render the correct number of page buttons.",
        "If the metadata request fails, MovieGrid still works with Back/Next pagination (graceful degradation), and errors follow the app’s existing error handling conventions."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui; compose existing UI components instead."
  ],
  "nonGoals": [
    "Adding pagination to genre-filtered results.",
    "Changing ITEMS_PER_PAGE from 10.",
    "Implementing infinite scroll or real-time updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}