{
  "kind": "build_request",
  "title": "Make the catalog installable on mobile as a home-screen app (PWA)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add Progressive Web App (PWA) support so the catalog can be installed as a home-screen app icon on iOS and Android, including a web app manifest, required icons, and appropriate meta tags.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "да"
        ]
      },
      "acceptanceCriteria": [
        "A valid web app manifest is available from the app origin (e.g., /manifest.webmanifest) and contains name/short_name, start_url, display, background_color, theme_color, and icon entries.",
        "The app includes icon assets for common PWA sizes (at least 192x192 and 512x512, plus a maskable icon) and references them from the manifest.",
        "frontend/index.html includes links/meta needed for installability (manifest link, theme-color, and Apple-specific tags such as apple-touch-icon and apple-mobile-web-app-capable where applicable).",
        "On Android/Chrome, the site shows as installable (install prompt available via browser UI) and installs with the correct name and icons.",
        "On iOS/Safari, “Add to Home Screen” creates a home-screen icon that launches the site in standalone mode (as supported by iOS)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a service worker to enable offline-capable app-shell behavior (cache static assets so the installed app can load a basic UI while offline), without modifying immutable entry files (e.g., frontend/src/main.tsx).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "да"
        ]
      },
      "acceptanceCriteria": [
        "A service worker is registered from a non-immutable file path (e.g., via code reachable from App.tsx or another editable module) and is active after a reload.",
        "When offline, loading the installed app shows a basic cached shell (header/layout) rather than a blank page (dynamic content may show an offline message).",
        "When online again, the app fetches fresh data normally; the service worker does not break authentication flows (Internet Identity login/logout still works)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an in-app, English help entry that explains how to install the catalog on mobile (Android Chrome and iOS Safari), placed in an existing discoverable UI location (e.g., Footer next to the publishing help).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "да"
        ]
      },
      "acceptanceCriteria": [
        "The UI includes an English “Install on phone” (or similar) action that opens a dialog or panel with platform-specific steps for Android and iOS.",
        "Instructions include at minimum: Android (Chrome menu → Install app / Add to Home screen) and iOS (Share button → Add to Home Screen).",
        "The new help UI matches the existing retro styling conventions used across the app."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (immutable paths).",
    "Keep backend as single-actor Motoko; no backend changes are required for PWA installability."
  ],
  "nonGoals": [
    "Building or publishing a native iOS/Android app to App Store / Google Play.",
    "Adding push notifications or background sync features."
  ],
  "imageRequirements": {
    "required": [
      "Neon retro VHS-style app icon with a stylized cassette and glow (app-icon.dim_512x512.png)",
      "Neon retro VHS-style app icon with a stylized cassette and glow (app-icon.dim_192x192.png)",
      "Neon retro VHS-style app icon, maskable-safe with generous padding and centered design (app-icon-maskable.dim_512x512.png)",
      "Apple touch icon variant in the same style (apple-touch-icon.dim_180x180.png)"
    ],
    "edits": []
  }
}