{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend recovery UI and startup health gating for backend unavailability",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Show a dedicated full-page recovery UI when the backend canister is stopped/unavailable, with Reload and Retry actions and preserved stopped-canister messaging.",
      "acceptanceCriteria": [
        "When requests fail with a stopped-canister signature (e.g., Reject code: 5 / \"canister is stopped\") the app shows a prominent recovery panel instead of an empty/partial UI.",
        "The recovery panel includes: (1) a Reload button that refreshes the page, and (2) a Retry button that re-runs the health check and refetches queries without a full reload.",
        "The recovery panel surfaces the existing stopped-canister copy already used by frontend/src/utils/errors.ts (do not regress this message).",
        "When the backend becomes available again, the app returns to normal operation without requiring a hard refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BackendUnavailableScreen.tsx",
          "operation": "create",
          "description": "Create a full-page 'Backend unavailable' recovery screen component that displays the normalized stopped-canister message, plus two actions: Reload (hard refresh) and Retry (calls provided callback). Use shadcn-ui Button (and any existing design tokens) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/context/BackendAvailabilityContext.tsx",
          "operation": "create",
          "description": "Add a small context/provider to track backend availability state (checking/available/unavailable), store the last backend-unavailable error message, and expose actions to report an unavailable error, clear it, and perform Retry (triggering health re-check and query refetch)."
        },
        {
          "path": "frontend/src/utils/errors.ts",
          "operation": "modify",
          "description": "Add an exported helper (predicate) to detect 'backend stopped/unavailable' signatures (e.g., Reject code: 5 / 'canister is stopped' and actor initialization failures) without changing the existing stopped-canister Russian copy returned by normalizeError()."
        },
        {
          "path": "frontend/src/components/MovieGrid.tsx",
          "operation": "modify",
          "description": "Route stopped-canister/actor-init related query failures into the global backend-unavailable recovery flow (via the BackendAvailabilityContext) instead of rendering the current generic error screen; keep non-backend-availability errors on the existing error UI."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "When genre loading fails with a stopped-canister/actor-init signature, report it to the BackendAvailabilityContext so the app shows the full-page recovery UI rather than only the small inline error indicator."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the BackendAvailabilityContext provider into the app tree and conditionally render BackendUnavailableScreen as a full-page replacement when backend is unavailable; ensure normal layout returns automatically when availability is restored."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Perform a startup backend connectivity check (health check) before enabling movie/genre/pagination queries and integrate Retry to re-check and refetch React Query data.",
      "acceptanceCriteria": [
        "On initial load, the frontend performs a health check before enabling data queries; while checking, the UI shows a non-blocking loading state (not a blank screen).",
        "If the health check fails, movie/genre/pagination queries are not executed repeatedly; instead, the recovery UI is shown.",
        "Pressing Retry triggers the health check again and, on success, triggers React Query refetch for movies/genres/pagination."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendHealth.ts",
          "operation": "create",
          "description": "Implement a React Query-powered hook that calls the backend health check capability (via the actor) and returns availability state + a refetch method suitable for the recovery UI's Retry action."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Gate movie/genre/pagination queries behind backend availability from useBackendHealth so they are not executed when health is failing; ensure retries do not loop while unavailable and enable refetch after health becomes available again."
        },
        {
          "path": "frontend/src/context/BackendAvailabilityContext.tsx",
          "operation": "modify",
          "description": "Integrate useBackendHealth into the provider: run the startup health check, expose a non-blocking 'checking' state, and implement Retry to refetch health then trigger React Query refetch/invalidation for movies/genres/pagination when health succeeds."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Show a non-blocking loading indicator during the initial health check (e.g., keep the existing skeleton-based UI visible while queries remain disabled) and ensure the recovery UI is shown when health fails."
        }
      ]
    }
  ]
}