{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve stopped-canister UX and hash secret cleanup",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Detect stopped backend canister (Reject code 5) in frontend error normalization and show a clear English message with reload recovery.",
      "acceptanceCriteria": [
        "When the replica returns an error containing text like \"Canister ... is stopped\" and/or \"Reject code: 5\", the Movies screen shows a specific English error message indicating the backend canister is stopped.",
        "The UI continues to offer a recovery action (e.g., reload) from the error state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errors.ts",
          "operation": "modify",
          "description": "Update normalizeError() to explicitly detect replica rejection cases indicating a stopped canister (e.g., message contains \"reject code: 5\" and/or \"canister\" + \"stopped\") and return a specific English user-facing message instructing the user to reload after the backend is restarted. Ensure existing generic 'Connection is being established…' is not used for this stopped-canister case."
        },
        {
          "path": "frontend/src/components/MovieGrid.tsx",
          "operation": "modify",
          "description": "Ensure the Movies error state continues to surface normalizeError() output and retains a recovery action (reload). If needed, adjust copy/layout to keep the stopped-canister message clearly visible in English without changing immutable UI component paths (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Clear caffeineAdminToken from URL hash for both '#token=value' and '#/route?token=value' forms while preserving other hash route/query content, without reloading.",
      "acceptanceCriteria": [
        "Given a URL like `https://vhs-golden-era-movie-collection-7n6.caffeine.xyz/#caffeineAdminToken=TOKEN`, after app initialization the `caffeineAdminToken` is stored in sessionStorage and is removed from `window.location.hash` without a page reload.",
        "Given a URL like `https://.../#/route?caffeineAdminToken=TOKEN&other=x`, after initialization the token is removed but `#/route?other=x` remains."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Fix secret extraction and hash cleanup logic to support both hash-only parameters without '?' (e.g., '#caffeineAdminToken=TOKEN') and hash routes with query strings (e.g., '#/route?caffeineAdminToken=TOKEN&other=x'). Update getSecretFromHash() to read the token from the correct hash segment, and update clearParamFromHash() to remove only the specified key while preserving any existing route/hash content and other parameters, using history.replaceState with no page reload."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure getSecretParameter('caffeineAdminToken') is executed during app initialization even when the user is not authenticated, so the token is stored in sessionStorage and removed from window.location.hash immediately. Keep passing the token only where needed for actor initialization, but always perform the read/cleanup step."
        }
      ]
    }
  ]
}